// TODO: 
// [x] ПРОИГРЫВАНИЕ В ФОНЕ
// [] ЧТОБЫ СЛЕД АУДИО ВРУБАЛОСЬ И В ФОНЕ ( уже сделан AudioProvider, всю логику туда. установлена expo-background-fetch )
// [] NOTIFICATION (appear on top) (widget)

// [] СКАЧИВАНИЕ ПЕСЕН И ВСЕ ЧТО ЭТОГО КАСАЕТСЯ
// [] Доступ к странице загрузки только при подлключенном интернете
// [] САЙТ

// [] Добавить САЙТ в футер или как отдельную плитку в Settings 
// [] Установка обновлений
// [] ОПТИМИЗАЦИЯ КОМПОНЕНТОВ, УДАЛЕНИЕ НЕ НУЖНОГО, ПРОВЕРИТЬ ЧТО ВСЕ TEXT FONSIZE ЗАДАНЫ ЧЕРЕЗ WIDTH
// [] Решить проблему со скроллингом
// [] Проверка, что везде есть перевод слов

// TODO: ПОСЛЕ ПРОДАКШИНА ПРИЛОЖЕНИЕ ДОЛЖНО РАБОТАТЬ БЫСТРЕЕ ЧЕМ В ДЕВ РЕЖИМЕ !!!!!!!!!!
// TODO: ПОИГРАТЬСЯ В ПРОДАКШИНЕ С WINDOW SIZE в FLATLIST
// TODO: ПРОВЕРИТЬ В ПРОДАКШИНЕ СКОРОСТЬ: AUDIOLIST, ADDTOPLAYLIST LIST, PLAYLIST LIST
// TODO: ПРОВЕРИТЬ В ПРОДАКШИНЕ СКОРОСТЬ ЗАПУСКА ПЕСНИ (с главной страницы, с плейлиста а затем с главной и понажимать на паузу): если что-то не так, то посмотреть в функцию play (audio.methods.ts)
// TODO:TODO: если будет лагать, то вернуть SDK 51 (expo version 51)
// TODO: удалить все ненужные зависимости


// TODO: ПОСЛЕ PRODUCTION:
// [] Удаление песни с устройства
// [] Проверка существует ли песня (если ее удалили, то ее запустить не получится, и будет ошибка)
// [] Добавление плейлиста на главный экран (shortcut) (как в Muzio Player)
// [] sortBy ?????
// [] Очистка плейлиста (удаление только песен) ???
// [] Детали песни (jpg/png, size)  ????